{
    "about": "<a href=\"#about_me\">À propos</a>",
    "portfolio": "<a href=\"#portfolio\">Portfolio</a>",
    "contact": "<a href=\"#contact\">Contact</a>",
    "h1_tag": "Bonjour, je suis Andrew et bienvenue sur mon <a href=\"#portfolio\">Portfolio!</a>",
    "about_title": "À propos de moi",
    "about_p1": "Je suis un développeur de logiciels full-stack sympathique et enthousiaste, passionné par le potentiel du code pour résoudre des problèmes. Dans mes temps libres, j'aime lire, voyager, cuisiner, nager et apprendre des langues.",
    "about_p2": "Après avoir obtenu mon diplôme en génie mécanique et travaillé pendant plusieurs années dans le secteur de l'efficacité énergétique, j'ai pris une pause carrière pour voyager et enseigner la plongée sous-marine avant de me concentrer sur mon intérêt pour la technologie. J'ai récemment terminé un bootcamp de codage full-stack de 16 semaines chez <a href=\"https://io-academy.uk\">iO Academy</a> à Bath, au Royaume-Uni, et je suis maintenant à la recherche d'opportunités professionnelles pour démarrer ma carrière dans le développement logiciel.",
    "portfolio_title": "Portfolio",
    "portfolio_intro": "Voici une sélection de projets présentant certaines des technologies avec lesquelles j'ai travaillé.",
    "galere_description": "Un site de blog avec du contenu créé à l'aide d'IA générative. Site réalisé avec Laravel, Inertia, Jetstream, Vue et Tailwind CSS. Les visiteurs peuvent consulter les articles, tandis que les utilisateurs enregistrés peuvent se connecter et créer/modifier/supprimer des articles. Les images ont été créées à l'aide de Nightcafe et Midjourney, tandis que les titres et descriptions ont été créés à l'aide de ChatGPT. Les développements futurs incluront la possibilité d'aimer et de commenter les publications.",
    "tubular_description": "Une application de planification d'itinéraire à part entière pour le métro londonien. Construit avec des données fictives fournies à l'aide de la pile MERN, le back-end étant déployé sur Heroku et le front-end sur Netlify. En choisissant une station de départ et d'arrivée, l'application recherche et affiche d'abord les itinéraires directs, puis ceux nécessitant des changements, par ordre décroissant de vitesse. C'est probablement l'application sur laquelle j'ai préféré travailler et qui a été un excellent exercice de développement JavaScript full-stack.",
    "carpe_diem_description": "Une application POO en PHP, stylisée à l'aide de SASS. Cette application consistait à remplir une base de données MySQL à l'aide de données au format JSON provenant d'une API, puis à extraire de cette base de données pour afficher une collection de voitures interrogeable et filtrable. En cliquant sur l'une des voitures, une nouvelle page s'ouvre affichant les informations sur la voiture plus en détail. C'était un excellent projet pour acquérir de l'expérience en travaillant dans le domaine de la POO, en concevant l'architecture d'une application du front-end au back-end, en utilisant des API et en travaillant avec SQL.",
    "scranmaster_description": "Le front-end d'une application de livraison de nourriture, construit en React et stylisé en utilisant Bootstrap pour correspondre aux wireframes haute fidélité fournis. L'extraction d'une API affiche une liste des restaurants disponibles et un menu filtrable pour chaque restaurant. Les articles peuvent être ajoutés à un panier de commande, qui calcule le coût total. L'envoi d'une commande ouvre une fenêtre modale affichant l'ETA et une barre de progression. Cette application a été une bonne occasion de se familiariser avec l'utilisation de React et Bootstrap dans une conception basée sur des composants.",
    "wordrunner_description": "Un jeu de devinette de mots construit en javascript. Les mots cibles et les synonymes sont récupérés à partir d'une API, et au début d'un nouveau jeu, un mot cible aléatoire est sélectionné et ses synonymes sont affichés au joueur. Le joueur dispose alors de 5 tentatives, ou d'un maximum de 30 secondes, pour deviner le mot cible. Cette application était vraiment amusante à créer et a été notre première expérience de travail collaboratif dans une équipe Scrum, ainsi qu'une bonne pratique du javascript et du CSS.",
    "vector_credit": "Illustrations vectorielles de <a href=\"https://www.vecteezy.com/free-vector/mobile-application-development\">Vecteezy</a>"
  }
  